//RMF3CPC  PROC NAME=                                 
//RMF3CPC  EXEC PGM=RMF3CPC                           
//RMFVSAM  DD DSN=&NAME,DISP=SHR                      
//PRINT    DD DSN=SLR.RMF3CPC,DISP=MOD                
//WARN     DD SYSOUT=H                                